Repository: davidelionetti/django-passwords
Catalog: passwords/locale/*/LC_MESSAGES/django.po
Languages: it

source: %i to %i characters
it: %i a %i caratteri

source: %i characters minimum
it: minimo %i caratteri

source: Invalid Length (%s)
it: Lunghezza invalida (%s)

source: Must be %s characters or more
it: Dev'essere lunga almeno %s caratteri

source: Must be %s characters or less
it: Dev'essere lunga al massimo %s caratteri

source: Must be more complex (%s)
it: Dev'essere più complessa (%s)

source: %(UPPER)s or more unique uppercase characters
it: Deve contenere %(UPPER)s o più lettere maiuscole

source: %(LOWER)s or more unique lowercase characters
it: Deve contenere %(UPPER)s o più lettere minuscole

source: %(LETTERS)s or more unique letters
it: Deve contenere %(WORDS)s o più parole uniche

source: %(DIGITS)s or more unique digits
it: Deve contenere %(DIGITS)s o più numeri

source: %(PUNCTUATION)s or more unique punctuation characters: %%s
it: Deve contenere %(PUNCTUATION)s o più segni di punteggiatura

source: %(SPECIAL)s or more non unique special characters
it: Deve contenere %(SPECIAL)s o più caratteri speciali

source: must contain
it: deve contenere

source: must contain %(WORDS)s or more unique words
it: Deve contenere %(WORDS)s o più parole uniche

source: Too Similar to [%(haystacks)s]
it: Troppo simile a a [%(haystacks)s]

source: Based on a dictionary word
it: Basato su un dizionario di parole

source: Based on a common sequence of characters
it: Basato su una sequenza di caratteri comuni
